Repository: jesse5555/sync-endpoint-default-setup
Catalog: locale/*/LC_MESSAGES/odk-x-sync-endpoint-init.po
Languages: fr

source: Found configuration at {env_file_location}
fr: Configuration trouvée à {env_file_location}

source: No default https configuration file found at expected path {env_file_location}. This prevents automatically renewing certs!
fr: Aucun fichier de configuration https par défaut n'a été trouvé au chemin attendu {env_file_location}. Cela empêche le renouvellement automatique des certificats!

source: Please check your paths and file permissions, and make sure your config repo is up to date.
fr: Veuillez vérifier vos chemins et autorisations de fichiers, et assurez-vous que votre référentiel de configuration est à jour.

source: Welcome to the ODK-X sync endpoint installation!
fr: Bienvenue dans l'installation du point de terminaison de synchronisation ODK-X!

source: This script will guide you through setting up your installation
fr: Ce script vous guidera dans la configuration de votre installation

source: We'll need some information from you to get started though...
fr: Nous aurons besoin de quelques informations de votre part pour commencer cependant...

source: Do you wish to use cached configuratilon?
fr: Souhaitez-vous utiliser la configuration en cache?

source: Please input the domain name you will use for this installation. A valid domain name is required for HTTPS without distributing custom certificates.
fr: Veuillez entrer le nom de domaine que vous utiliserez pour cette installation. Un nom de domaine valide est requis pour HTTPS sans distribution de certificats personnalisés.

source: domain [({envParam_https_domain})]
fr: domaine [({envParam_https_domain})]

source: Do you want to use a custom LDAP administration password?
fr: Voulez-vous utiliser un mot de passe d'administration LDAP personnalisé ?

source: Please input the password to use for ldap admin
fr: Veuillez saisir le mot de passe à utiliser pour l'administrateur ldap

source: Ldap admin password
fr: Mot de passe administrateur LDAP

source: Password set to: {default_ldap_pwd}
fr: Mot de passe défini sur : {default_ldap_pwd}

source: Would you like to enforce HTTPS? We recommend yes.
fr: Souhaitez-vous appliquer le HTTPS ? Nous recommandons oui.

source: Would you like to run an INSECURE and DANGEROUS server that will share your users's information if exposed to the Internet?
fr: Souhaitez-vous exécuter un serveur INSÉCURISÉ et DANGEREUX qui partagera les informations de vos utilisateurs s'il est exposé à Internet?

source: run insecure?
fr: courir sans sécurité ?

source: HTTPS is currently required to run a secure public server. Please restart and select to enforce HTTPS
fr: HTTPS est actuellement requis pour exécuter un serveur public sécurisé. Veuillez rétablir et sélectionner pour appliquer HTTPS

source: Enforcing https: {enforce_https}
fr: Application de https : {enforce_https}

source: Please provide an admin email for security updates with HTTPS registration
fr: Veuillez fournir un e-mail d'administrateur pour les mises à jour de sécurité avec l'enregistrement HTTPS

source: admin email [({envParam_https_admin_email})]
fr: e-mail de l'administrateur [({envParam_https_admin_email})]

source: The system will now attempt to setup an HTTPS certificate for this server.
fr: Le système va maintenant tenter de configurer un certificat HTTPS pour ce serveur.

source: For this to work you must have already have purchased/acquired a domain name (or subdomain) and setup a DNS A or AAAA record to point at this server's IP address.
fr: Pour que cela fonctionne, vous devez avoir déjà acheté/acquis un nom de domaine (ou sous-domaine) et configuré un enregistrement DNS A ou AAAA pour pointer vers l'adresse IP de ce serveur.

source: If you have not done this yet, please do it now...
fr: Si vous ne l'avez pas encore fait, faites-le maintenant...

source: Domain is ready to proceed with certificate acquisition?
fr: Le domaine est prêt à procéder à l'acquisition du certificat?

source: Re-run this script once the domain is ready!
fr: Réexécutez ce script une fois que le domaine est prêt!

source: Do you wish to supply your own SSL certificate? If not, the script will use certbot (please make sure it is already installed).
fr: Souhaitez-vous fournir votre propre certificat SSL ? Sinon, le script utilisera certbot (veuillez vous assurer qu'il est déjà installé).

source: Attempting to save updated https configuration
fr: Tentative d'enregistrement de la configuration https mise à jour

source: enforce https?
fr: appliquer https?

source: Invalid email address: {email}
fr: Adresse e-mail invalide : {email}

source: Re-run this script with the correct email address.
fr: Réexécutez ce script avec l'adresse e-mail correcte.

source: Invalid domain: {domain}
fr: Domaine non valide : {domain}

source: Re-run this script with the correct domain.
fr: Réexécutez ce script avec le domaine correct.

source: Please enter path to fullchain .pem/.crt file
fr: Veuillez entrer le chemin d'accès au fichier .pem/.crt de la chaîne complète

source: fullchain file [({cert_fullchain_path})]
fr: fichier de chaîne complète [({cert_fullchain_path})]

source: Please enter path to private key .pem file
fr: Veuillez saisir le chemin d'accès au fichier de clé privée .pem

source: private key file [({cert_privkey_path})]
fr: fichier de clé privée [({cert_privkey_path})]

source: Input not provided, re-run this script with correct inputs.
fr: Entrée non fournie, réexécutez ce script avec les entrées correctes.

source: File at the given path do not exists, re-run this script with correct inputs.
fr: Le fichier au chemin donné n'existe pas, réexécutez ce script avec les entrées correctes.

source: Please enter your system Password
fr: Veuillez entrer votre mot de passe système

source: Error pulling required docker images.
fr: Erreur lors de l'extraction des images docker requises.

source: Error building sync endpoint.
fr: Erreur lors de la création du point de terminaison de synchronisation.

source: Error deploying stack.
fr: Erreur lors du déploiement de la pile.
